org/an_abm_of_the_computer_programming_domain.org
#+setupfile:./hugo_setup.org
#+hugo_slug: abm
#+title: An ABM of the computer programming domain
#+roam_tags: RO

This would be a paper writing up our agent model work.

The paper could also correspond to a “whitepaper” that talks about how
we are able to “mine” computer programs automatically.  This would
contribute to a long-term business in automated programming (and
potentially other kinds of automation work).

* Contributes to 

- [[file:research_outputs.org][RESEARCH OUTPUTS]]
- [[file:20200814210243-business_development.org][BUSINESS DEVELOPMENT]]
