content/posts/an_abm_of_the_computer_programming_domain.md
+++
title = "An ABM of the computer programming domain"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:31+01:00
slug = "abm"
draft = false
+++

This would be a paper writing up our agent model work.

The paper could also correspond to a “whitepaper” that talks about how
we are able to “mine” computer programs automatically.  This would
contribute to a long-term business in automated programming (and
potentially other kinds of automation work).


## Contributes to {#contributes-to}

-   [RESEARCH OUTPUTS]({{< relref "research_outputs" >}})
-   [BUSINESS DEVELOPMENT]({{< relref "business_development" >}})


## Backlinks {#backlinks}

-   [Agent model]({{< relref "agent_model" >}})
